using System;

namespace Data_types
{
    class Program
    {
        static void Main(string[] args)
        {
            // bool: хранит значение true или false(логические литералы).Представлен системным типом System.Boolean
            bool aLive = true;
            bool isDead = false;

            //byte: хранит целое число от 0 до 255 и занимает 1 байт.Представлен системным типом System.Byte
            byte bit1 = 0;
            byte bit2 = 255;

            //sbyte: хранит целое число от -128 до 127 и занимает 1 байт. Представлен системным типом System.SByte
            sbyte bit3 = -128;
            sbyte bit4 = 127;

            //short: хранит целое число от -32768 до 32767 и занимает 2 байта. Представлен системным типом System.Int16
            short short1 = -32768;
            short short2 = 32767;

            //ushort: хранит целое число от 0 до 65535 и занимает 2 байта. Представлен системным типом System.UInt16
            ushort n1 = 0;
            ushort n2 = 65535;

            //int: хранит целое число от -2147483648 до 2147483647 и занимает 4 байта. Представлен системным типом System.Int32.
            int a = 10;
            int b = 0b101;
            int c = 0xFF;

            //uint: хранит целое число от 0 до 4294967295 и занимает 4 байта. Представлен системным типом System.UInt32
            uint ua = 0;
            uint ub = 321321321;

            //long: хранит целое число от –9 223 372 036 854 775 808 до 9 223 372 036 854 775 807 и занимает 8 байт. Представлен системным типом System.Int64
            long f = -323213213213123;
            long g = 0b1001101010011;

            //

        }
    }
}
